10/data/attachments/1d54e16e1b788ddb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_dc85437c-9bba-43d5-9f74-b4dffd5b443a</nif:username>
            <nif:friendToBeAdded>Todd_run_Friend_84930_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>